# Домашнее задание на тему "Оптимизация запросов"

## Планы выполнения до создания индекса

Ниже представлен план выполнения запроса (команда PROFILE)

```

PROFILE MATCH (n:RWS)-[:PINNED]-(:CITY)
MATCH (k:CITY)-[:NEAREST]-(:LOC)
MATCH (m:RWS)-[:PINNED]-(k)
MATCH p = (n)-[:RWROUTE*1..]-(m)
RETURN p

```

```

Planner COST

Runtime PIPELINED

Runtime version 5.9

Batch size 128

+-----------------------+----+-------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator              | Id | Details                       | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------------+----+-------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults       |  0 | p                             |             25 |   11 |     105 |                |                        |           |                     |
| |                     +----+-------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Projection           |  1 | (n)-[anon_5*]-(m) AS p        |             25 |   11 |       0 |                |                        |           |                     |
| |                     +----+-------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter               |  2 | anon_1:CITY                   |             25 |   11 |      22 |                |                        |           |                     |
| |                     +----+-------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)          |  3 | (n)-[anon_0:PINNED]-(anon_1)  |             25 |   11 |      39 |                |                        |           |                     |
| |                     +----+-------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter               |  4 | n:RWS                         |             21 |   11 |      22 |                |                        |           |                     |
| |                     +----+-------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +VarLengthExpand(All) |  5 | (m)-[anon_5:RWROUTE*]-(n)     |             21 |   11 |      68 |            128 |                        |           |                     |
| |                     +----+-------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter               |  6 | m:RWS                         |             16 |   11 |      44 |                |                        |           |                     |
| |                     +----+-------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)          |  7 | (k)-[anon_4:PINNED]-(m)       |             24 |   22 |      44 |                |                        |           |                     |
| |                     +----+-------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter               |  8 | k:CITY                        |             14 |   11 |      22 |                |                        |           |                     |
| |                     +----+-------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)          |  9 | (anon_3)-[anon_2:NEAREST]-(k) |             14 |   11 |      31 |                |                        |           |                     |
| |                     +----+-------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeByLabelScan      | 10 | anon_3:LOC                    |             20 |   20 |      21 |            248 |                    4/0 |     2.458 | Fused in Pipeline 0 |
+-----------------------+----+-------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 418, total allocated memory: 352

Started streaming 11 records after 1ms and completed after 4ms.

```

Ниже представлен план выполнения запроса (команда EXPLAIN)

```

EXPLAIN MATCH (n:RWS)-[:PINNED]-(:CITY)
MATCH (k:CITY)-[:NEAREST]-(:LOC)
MATCH (m:RWS)-[:PINNED]-(k)
MATCH p = (n)-[:RWROUTE*1..]-(m)
RETURN p

```

```

Planner COST

Runtime PIPELINED

Runtime version 5.9

Batch size 128

+-----------------------+----+-------------------------------+----------------+---------------------+
| Operator              | Id | Details                       | Estimated Rows | Pipeline            |
+-----------------------+----+-------------------------------+----------------+---------------------+
| +ProduceResults       |  0 | p                             |             25 |                     |
| |                     +----+-------------------------------+----------------+                     |
| +Projection           |  1 | (n)-[anon_5*]-(m) AS p        |             25 |                     |
| |                     +----+-------------------------------+----------------+                     |
| +Filter               |  2 | anon_1:CITY                   |             25 |                     |
| |                     +----+-------------------------------+----------------+                     |
| +Expand(All)          |  3 | (n)-[anon_0:PINNED]-(anon_1)  |             25 |                     |
| |                     +----+-------------------------------+----------------+                     |
| +Filter               |  4 | n:RWS                         |             21 |                     |
| |                     +----+-------------------------------+----------------+                     |
| +VarLengthExpand(All) |  5 | (m)-[anon_5:RWROUTE*]-(n)     |             21 |                     |
| |                     +----+-------------------------------+----------------+                     |
| +Filter               |  6 | m:RWS                         |             16 |                     |
| |                     +----+-------------------------------+----------------+                     |
| +Expand(All)          |  7 | (k)-[anon_4:PINNED]-(m)       |             24 |                     |
| |                     +----+-------------------------------+----------------+                     |
| +Filter               |  8 | k:CITY                        |             14 |                     |
| |                     +----+-------------------------------+----------------+                     |
| +Expand(All)          |  9 | (anon_3)-[anon_2:NEAREST]-(k) |             14 |                     |
| |                     +----+-------------------------------+----------------+                     |
| +NodeByLabelScan      | 10 | anon_3:LOC                    |             20 | Fused in Pipeline 0 |
+-----------------------+----+-------------------------------+----------------+---------------------+

Total database accesses: ?

```

## Создание индексов

В плане выполнения запроса в последней строке указан оператор *NodeByLabelScan*. Это верный признак того, что необходим *Lookup* индекс
по узлам - должен использоваться оператор *NodeByLabelSeek*.

Создаю индекс:

```

CREATE LOOKUP INDEX node_label_lookup_index FOR (n) ON EACH labels(n)

```

В ответ получаю следующее:

```

Neo.ClientError.Schema.IndexAlreadyExists
There already exists an index (:<any-labels>).

```

Видимо, в AuraDB включена опция автоиндексирования. Но почему же используется оператор *NodeByLabelScan*? Я считаю, по аналогии с реляционными базами данных,
что стоимость сканирования меньше чем выборка с использованием индекса. Это связано с малым количеством данных (узлов), т.е. 
последовательный перебор получается быстрее, чем выборка с использованием индекса.

Аналогичная ситуация и с индексом по связям:

```

CREATE LOOKUP INDEX rel_type_lookup_index FOR ()-[r]-() ON EACH type(r)

```

```

Neo.ClientError.Schema.IndexAlreadyExists
There already exists an index ()-[:<any-types>]-().


```
